holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
        case KB_MAPPING_C1: kb = &kb_numdec; printf("[set_keyboard_context_cb] Using numeric keyboard for KB_MAPPING_C1\n"); break;
        case KB_MAPPING_C2: kb = &kb_numdec; printf("[set_keyboard_context_cb] Using numeric keyboard for KB_MAPPING_C2\n"); break;
        case KB_MAPPING_C3: kb = &kb_numdec; printf("[set_keyboard_context_cb] Using numeric keyboard for KB_MAPPING_C3\n"); break;
        case KB_MAPPING_C4: kb = &kb_numdec; printf("[set_keyboard_context_cb] Using numeric keyboard for KB_MAPPING_C4\n"); break;
        case KB_MAPPING_C5: kb = &kb_numdec; printf("[set_keyboard_context_cb] Using numeric keyboard for KB_MAPPING_C5\n"); break;

        case KB_USER_LATITUDE: kb = &kb_numdec; printf("[set_keyboard_context_cb] Using numeric keyboard for KB_USER_LATITUDE\n"); break;
        case KB_USER_LONGITUDE: kb = &kb_numdec; printf("[set_keyboard_context_cb] Using numeric keyboard for KB_USER_LONGITUDE\n"); break;
        case KB_USER_ALTITUDE: kb = &kb_numdec; printf("[set_keyboard_context_cb] Using numeric keyboard for KB_USER_ALTITUDE\n"); break;
        case KB_USER_SPEED: kb = &kb_numdec; printf("[set_keyboard_context_cb] Using numeric keyboard for KB_USER_SPEED\n"); break;
        case KB_USER_GROUND_HEADING: kb = &kb_numdec; printf("[set_keyboard_context_cb] Using numeric keyboard for KB_USER_GROUND_HEADING\n"); break;
        case KB_UTC_OFFSET_SECONDS: kb = &kb_numdec; printf("[set_keyboard_context_cb] Using numeric keyboard for KB_UTC_OFFSET_SECONDS\n"); break;

        /* ... add other cases as required */
        default: printf("[set_keyboard_context_cb] Unknown keyboard target: %d\n", ctx->target); return;
    }

    // Link the clicked textarea to the keyboard for later retrieval in the keyboard event handler
    lv_obj_set_user_data(kb->ta, target_obj);
    printf("[set_keyboard_context_cb] Linked keyboard TA: %p to object: %p\n", (void*)kb->ta, (void*)target_obj);
    
    // Show keyboard
    printf("[set_keyboard_context_cb] Bringing keyboard to foreground.\n");
    lv_obj_move_foreground(kb->kb);
    lv_obj_move_foreground(kb->ta);
    lv_obj_clear_flag(kb->kb, LV_OBJ_FLAG_HIDDEN);
    lv_obj_clear_flag(kb->ta, LV_OBJ_FLAG_HIDDEN);
}

/** ---------------------------------------------------------------------------------------
 * @brief Event callback for keyboard events.
 * 
 * Intended to be used across multiple keyboards by linking the relevant object to a
 * related keyboard via user data.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void keyboard_event_cb(lv_event_t * e)
{
    // Get event code
    lv_event_code_t code = lv_event_get_code(e);
    printf("[keyboard_event_cb] Keyboard Event Code: %d\n", code);
    if(code != LV_EVENT_VALUE_CHANGED) {
        printf("[keyboard_event_cb] Event code is not VALUE_CHANGED, returning.\n");
        return;
    }

    // Get event target
    lv_obj_t * kb_target = (lv_obj_t *)lv_event_get_target(e);
    printf("[keyboard_event_cb] Keyboard Target: %p\n", (void*)kb_target);
    keyboard_t * kb_user_data = (keyboard_t *)lv_event_get_user_data(e);
    printf("[keyboard_event_cb] Keyboard User Data: %p\n", (void*)kb_user_data);

    // Ensure the event is from an expected keyboard
    if(kb_target != kb_user_data->kb) {
        printf("[keyboard_event_cb] Event target does not match keyboard in user data, returning.\n");
        return;
    }

    // Get the text of the selected object
    uint32_t obj_id = lv_keyboard_get_selected_btn(kb_user_data->kb);
    printf("[keyboard_event_cb] Selected Button ID: %lu\n", obj_id);
    const char * obj_text = lv_keyboard_get_btn_text(kb_user_data->kb, obj_id);
    printf("[keyboard_event_cb] Selected Button Text: %s\n", obj_text);

    // Only proceed if "OK", "Enter", or the LV_SYMBOL_OK button was pressed
    if(strcmp(obj_text, LV_SYMBOL_OK) != 0 &&
       strcmp(obj_text, "Enter") != 0 &&
       strcmp(obj_text, "OK") != 0) {return;}

    // Get the designated textarea that triggered this keyboard
    lv_obj_t * designated_ta = (lv_obj_t *)lv_obj_get_user_data(kb_user_data->ta);
    printf("[keyboard_event_cb] Designated Textarea from User Data: %p\n", (void*)designated_ta);
    if(!designated_ta) {
        printf("[keyboard_event_cb] No designated textarea found in user data, returning.\n");
        return;
    }

    // Get context from designated textarea
    kb_ctx_t * ctx = (kb_ctx_t *)lv_obj_get_user_data(designated_ta);
    printf("[keyboard_event_cb] Context Target from Designated Textarea: %d\n", ctx ? ctx->target : -1);

    // Get the input text from the keyboard's textarea
    const char * input = lv_textarea_get_text(kb_user_data->ta);
    printf("[keyboard_event_cb] Input Text from Keyboard Textarea: %s\n", input);

    // Route to correct destination using context
    switch (ctx ? ctx->target : KB_TARGET_NONE) {

        case KB_MATRIX_VALUE_X:
            if (strval_validate(ctx->strval_type, input)) {
                double val = strtod(input, NULL);
                printf("[keyboard_event_cb] Setting MATRIX_VALUE_X to: %f\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid double: %s\n", input);
            }
            break;

        case KB_MATRIX_VALUE_Y:
            if (strval_validate(ctx->strval_type, input)) {
                double val = strtod(input, NULL);
                printf("[keyboard_event_cb] Setting MATRIX_VALUE_Y to: %f\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid double: %s\n", input);
            }
            break;
        
        case KB_MATRIX_VALUE_Z:
            if (strval_validate(ctx->strval_type, input)) {
                double val = strtod(input, NULL);
                printf("[keyboard_event_cb] Setting MATRIX_VALUE_Z to: %f\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid double: %s\n", input);
            }
            break;
        
        case KB_MATRIX_OUTPUT_PWM_0:
            if (strval_validate(ctx->strval_type, input)) {
                uint32_t val = strtoul(input, NULL, 10);
                printf("[keyboard_event_cb] Setting MATRIX_OUTPUT_PWM_0 to: %lu\n", val);
                // lv_textarea_set_text(...); // Update relevant object if needed
                matrixData.output_pwm[0][current_matrix_i][INDEX_MATRIX_SWITCH_PWM_OFF] = val;
                matrixData.matrix_switch_write_required[0][current_matrix_i]=true;
            }
            else {
                printf("[keyboard_event_cb] Input is not a valid uint32_t: %s\n", input);
            }
            break;
        
