holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Outline
    lv_obj_set_style_outline_width(result.panel, outline_width, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.panel, default_outline_hue, LV_PART_MAIN);
    lv_obj_set_style_outline_pad(result.panel, outline_padding, LV_PART_MAIN);
    
    // Border
    lv_obj_set_style_border_width(result.panel, 0, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.panel, default_border_hue, LV_PART_MAIN);

    // Background
    lv_obj_set_style_bg_color(result.panel, default_bg_hue, LV_PART_MAIN);

    // Flex
    lv_obj_set_flex_flow(result.panel, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_flex_align(result.panel, LV_FLEX_ALIGN_START, LV_FLEX_ALIGN_START, LV_FLEX_ALIGN_START);

    // Row sizes
    int32_t sub_row_width = width_px - (outer_pad_all*2);
    int32_t sub_row_height = row_height-(outline_padding*2);

    // Row Object sizes
    int32_t obj_w_0 = 0;
    int32_t obj_w_1 = 0;
    int32_t obj_w_2 = 0;
    int32_t obj_w_3 = 0;
    int32_t obj_w_4 = 0;
    int32_t obj_w_5 = 0;
    int32_t obj_height = sub_row_height-(outline_width*2)-(sub_row_padding*2);

    /* ---------------------------------------------------------- */
    /* Row UTC Time                                               */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_utc_time = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 200;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_utc_time = create_label(
        row_utc_time,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "UTC Time",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_utc_time = create_label(
        row_utc_time,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_utc_time, obj_w_0, obj_height);
    lv_obj_set_size(result.val_utc_time, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Positioning Status                                     */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_positioning_status = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 200;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_positioning_status = create_label(
        row_positioning_status,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Pos Status",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_positioning_status = create_label(
        row_positioning_status,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_positioning_status, obj_w_0, obj_height);
    lv_obj_set_size(result.val_positioning_status, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Latitude                                               */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_latitude = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 200;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_latitude = create_label(
        row_latitude,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Latitude",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_latitude = create_label(
        row_latitude,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_latitude, obj_w_0, obj_height);
    lv_obj_set_size(result.val_latitude, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Longitude                                              */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_longitude = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

