holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    result.btn_auto_set_user_lat = create_button(
        row_user_lat,         // parent
        obj_w_2,              // width px
        obj_height,           // height px
        LV_ALIGN_CENTER,      // alignment
        0,                    // pos x
        0,                    // pos y
        "+",                  // label text
        LV_TEXT_ALIGN_CENTER, // text align
        false,                // show scrollbar
        false,                // enable scrolling
        &cobalt_alien_17,     // font for labels
        radius_rounded,
        default_btn_bg,
        default_btn_toggle_value_hue
    );
    lv_obj_add_event_cb(result.btn_auto_set_user_lat.button, btn_auto_set_user_lat_event_cb, LV_EVENT_CLICKED, NULL);

    lv_obj_set_size(result.lbl_user_deg_lat, obj_w_0, obj_height);
    lv_obj_set_size(result.ta_user_deg_lat, obj_w_1, obj_height);
    lv_obj_set_size(result.btn_auto_set_user_lat.panel, obj_w_2, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Degrees User Longitude                                 */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_user_lon = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250;
    obj_w_2 = 30;
    obj_w_1 = (((sub_row_width/1) *1) - obj_w_0 - obj_w_2) - (sub_column_padding*3);

    result.lbl_user_deg_lon = create_label(
        row_user_lon,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "[USER] Degrees Longitude",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.ta_user_deg_lon = create_textarea(
        row_user_lon,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        true,
        "0123456789.-",
        "0",
        false,
        false,
        false,
        &cobalt_alien_17,
        LV_TEXT_ALIGN_CENTER
    );
    lv_obj_add_event_cb(result.ta_user_deg_lon, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_user_deg_lon, &user_longitude_ctx);

    result.btn_auto_set_user_lon = create_button(
        row_user_lon,         // parent
        obj_w_2,              // width px
        obj_height,           // height px
        LV_ALIGN_CENTER,      // alignment
        0,                    // pos x
        0,                    // pos y
        "+",                  // label text
        LV_TEXT_ALIGN_CENTER, // text align
        false,                // show scrollbar
        false,                // enable scrolling
        &cobalt_alien_17,     // font for labels,
        radius_rounded,
        default_btn_bg,
        default_btn_toggle_value_hue
    );
    lv_obj_add_event_cb(result.btn_auto_set_user_lon.button, btn_auto_set_user_lon_event_cb, LV_EVENT_CLICKED, NULL);

    lv_obj_set_size(result.lbl_user_deg_lon, obj_w_0, obj_height);
    lv_obj_set_size(result.ta_user_deg_lon, obj_w_1, obj_height);
    lv_obj_set_size(result.btn_auto_set_user_lon.panel, obj_w_2, obj_height);

    /* ---------------------------------------------------------- */
    /* Row System Degrees Latitude                                */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_sys_lat = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250;
    obj_w_1 = (((sub_row_width/1) *1) - obj_w_0) - (sub_column_padding*2);

    result.lbl_sys_deg_lat= create_label(
        row_sys_lat,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "[SYS] Degrees Latitude",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_sys_deg_lat = create_label(
        row_sys_lat,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_sys_deg_lat, obj_w_0, obj_height);
    lv_obj_set_size(result.val_sys_deg_lat, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row System Degrees Longitude                               */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_sys_lon = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250;
    obj_w_1 = (((sub_row_width/1) *1) - obj_w_0) - (sub_column_padding*2);

    result.lbl_sys_deg_lon = create_label(
        row_sys_lon,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "[SYS] Degrees Longitude",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_sys_deg_lon = create_label(
        row_sys_lon,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_sys_deg_lon, obj_w_0, obj_height);
    lv_obj_set_size(result.val_sys_deg_lon, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Location Mode                                          */
    /* ---------------------------------------------------------- */

