holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_set_size(result.lbl_mileage, obj_w_0, obj_height);
    lv_obj_set_size(result.val_mileage, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Title Local Time                                           */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_title_local_time = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = sub_row_width - (sub_column_padding);

    result.lbl_title_local_time = create_label(
        row_title_local_time,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "LOCAL TIME",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_title_hue,
        default_title_hue
    );

    lv_obj_set_size(result.lbl_title_local_time, obj_w_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row UTC Second Offset                                      */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_utc_offset = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_utc_second_offset = create_label(
        row_utc_offset,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "UTC Offset (s)",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.ta_utc_second_offset = create_textarea(
        row_utc_offset,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        true,
        "0123456789-",
        "0",
        false,
        false,
        false,
        &cobalt_alien_17,
        LV_TEXT_ALIGN_CENTER
    );
    lv_obj_add_event_cb(result.ta_utc_second_offset, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_utc_second_offset, &user_utc_offset_seconds_ctx);

    lv_obj_set_size(result.lbl_utc_second_offset, obj_w_0, obj_height);
    lv_obj_set_size(result.ta_utc_second_offset, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row UTC Auto Offset Flag                                   */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_utc_auto_offset = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_utc_auto_offset_flag = create_label(
        row_utc_auto_offset,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Auto UTC Offset",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_utc_auto_offset_flag = create_label(
        row_utc_auto_offset,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_utc_auto_offset_flag, obj_w_0, obj_height);
    lv_obj_set_size(result.val_utc_auto_offset_flag, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Set Time Automatically                                 */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_auto_time_set = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_set_time_automatically = create_label(
        row_auto_time_set,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Auto Time Set",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_set_time_automatically = create_label(
        row_auto_time_set,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_set_time_automatically, obj_w_0, obj_height);
    lv_obj_set_size(result.val_set_time_automatically, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Local Year Day                                         */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_local_yday = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

