holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Set row object widths
    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_formatted_local_date = create_label(
        row_formatted_local_date,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Local Date",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_formatted_local_date = create_label(
        row_formatted_local_date,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_formatted_local_date, obj_w_0, obj_height);
    lv_obj_set_size(result.val_formatted_local_date, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Local Unix Time (μs)                                   */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_local_unix_us = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_local_unixtime_us = create_label(
        row_local_unix_us,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "Local Unix uS",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_local_unixtime_us = create_label(
        row_local_unix_us,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_local_unixtime_us, obj_w_0, obj_height);
    lv_obj_set_size(result.val_local_unixtime_us, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Title RTC                                                  */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_title_rtc_time = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = sub_row_width - (sub_column_padding);

    result.lbl_title_rtc_time = create_label(
        row_title_rtc_time,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "RTC TIME",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_title_hue,
        default_title_hue
    );

    lv_obj_set_size(result.lbl_title_rtc_time, obj_w_0, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Formatted RTC Time                                     */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_formatted_rtc_time = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_formatted_rtc_time = create_label(
        row_formatted_rtc_time,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "RTC Time",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_formatted_rtc_time = create_label(
        row_formatted_rtc_time,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_formatted_rtc_time, obj_w_0, obj_height);
    lv_obj_set_size(result.val_formatted_rtc_time, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row Formatted RTC Date                                     */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_formatted_rtc_date = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_formatted_rtc_date = create_label(
        row_formatted_rtc_date,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "RTC Date",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_formatted_rtc_date = create_label(
        row_formatted_rtc_date,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_formatted_rtc_date, obj_w_0, obj_height);
    lv_obj_set_size(result.val_formatted_rtc_date, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row RTC Unix Time                                          */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_rtc_unix_time = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

