holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                // Map Mode 0
                if (mappingData.map_mode[0][current_mapping_i]==MAP_MODE_MIN_TO_MAX) {
                    // C0
                    lv_label_set_text(mcc.c0, String(mappingData.char_map_mode_config_names[MAP_MODE_MIN_TO_MAX][INDEX_MAP_C0]).c_str());
                    
                    // C1
                    lv_label_set_text(mcc.c1, String(mappingData.char_map_mode_config_names[MAP_MODE_MIN_TO_MAX][INDEX_MAP_C1]).c_str());
                    // C2
                    lv_label_set_text(mcc.c2, String(mappingData.char_map_mode_config_names[MAP_MODE_MIN_TO_MAX][INDEX_MAP_C2]).c_str());
                    // C3
                    lv_label_set_text(mcc.c3, String(mappingData.char_map_mode_config_names[MAP_MODE_MIN_TO_MAX][INDEX_MAP_C3]).c_str());
                    // C4
                    lv_label_set_text(mcc.c4, String(mappingData.char_map_mode_config_names[MAP_MODE_MIN_TO_MAX][INDEX_MAP_C4]).c_str());
                    // C5
                    lv_label_set_text(mcc.c5, String(mappingData.char_map_mode_config_names[MAP_MODE_MIN_TO_MAX][INDEX_MAP_C5]).c_str());
                }
                // Map Mode 1
                else if (mappingData.map_mode[0][current_mapping_i]==MAP_MODE_CENTER_MAP_AXIS_0) {
                    // C0
                    lv_label_set_text(mcc.c0, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_0][INDEX_MAP_C0]).c_str());
                    // C1
                    lv_label_set_text(mcc.c1, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_0][INDEX_MAP_C1]).c_str());
                    // C2
                    lv_label_set_text(mcc.c2, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_0][INDEX_MAP_C2]).c_str());
                    // C3
                    lv_label_set_text(mcc.c3, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_0][INDEX_MAP_C3]).c_str());
                    // C4
                    lv_label_set_text(mcc.c4, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_0][INDEX_MAP_C4]).c_str());
                    // C5
                    lv_label_set_text(mcc.c5, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_0][INDEX_MAP_C5]).c_str());
                }
                // Map Mode 2
                else if (mappingData.map_mode[0][current_mapping_i]==MAP_MODE_CENTER_MAP_AXIS_1) {
                    // C0
                    lv_label_set_text(mcc.c0, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_1][INDEX_MAP_C0]).c_str());
                    // C1
                    lv_label_set_text(mcc.c1, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_1][INDEX_MAP_C1]).c_str());
                    // C2
                    lv_label_set_text(mcc.c2, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_1][INDEX_MAP_C2]).c_str());
                    // C3
                    lv_label_set_text(mcc.c3, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_1][INDEX_MAP_C3]).c_str());
                    // C4
                    lv_label_set_text(mcc.c4, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_1][INDEX_MAP_C4]).c_str());
                    // C5
                    lv_label_set_text(mcc.c5, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_1][INDEX_MAP_C5]).c_str());
                }

                lv_dropdown_set_selected(mcc.dd_c0, (int)mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C0]);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mcc.dd_c0), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mcc.dd_c0), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_DEFAULT);

                lv_textarea_set_text(mcc.ta_c1, String(mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C1]).c_str());

                lv_textarea_set_text(mcc.ta_c2, String(mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C2]).c_str());

                lv_textarea_set_text(mcc.ta_c3, String(mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C3]).c_str());

                lv_textarea_set_text(mcc.ta_c4, String(mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C4]).c_str());

                lv_textarea_set_text(mcc.ta_c5, String(mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C5]).c_str());

                lv_dropdown_set_selected(mcc.dd_mode, mappingData.map_mode[0][current_mapping_i]);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mcc.dd_mode), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mcc.dd_mode), rainbow_contrast_value_hue, LV_PART_SELECTED | LV_STATE_DEFAULT);

                lv_label_set_text(mcc.value_input, String(get_mapping_input_value(current_mapping_i)).c_str());

                lv_label_set_text(mcc.value_map_result, String(mappingData.mapped_value[0][current_mapping_i]).c_str());
            }
        }
    }
    // ---------------------
    // gps screen
    // ---------------------
    else if (current_screen_number == GPS_SCREEN) {

        if (current_gps_panel == 0) {
            if (satio_c.panel) {
                // Hide
                lv_obj_add_flag(gngga_c.panel, LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(gnrmc_c.panel, LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(gpatt_c.panel, LV_OBJ_FLAG_HIDDEN);

                // Show
                lv_obj_remove_flag(satio_c.panel, LV_OBJ_FLAG_HIDDEN);

                // Switch Panel
                lv_obj_set_style_text_color(gps_switch_panel.switch_satio_panel.label, rainbow_contrast_value_hue, LV_PART_MAIN);
                lv_obj_set_style_bg_color(gps_switch_panel.switch_satio_panel.panel, default_btn_on_bg, LV_PART_MAIN);

                lv_obj_set_style_text_color(gps_switch_panel.switch_gngga_panel.label, default_btn_off_value_hue, LV_PART_MAIN);
                lv_obj_set_style_bg_color(gps_switch_panel.switch_gngga_panel.panel, default_btn_off_bg, LV_PART_MAIN);

                lv_obj_set_style_text_color(gps_switch_panel.switch_gnrmc_panel.label, default_btn_off_value_hue, LV_PART_MAIN);
                lv_obj_set_style_bg_color(gps_switch_panel.switch_gnrmc_panel.panel, default_btn_off_bg, LV_PART_MAIN);

                lv_obj_set_style_text_color(gps_switch_panel.switch_gpatt_panel.label, default_btn_off_value_hue, LV_PART_MAIN);
                lv_obj_set_style_bg_color(gps_switch_panel.switch_gpatt_panel.panel, default_btn_off_bg, LV_PART_MAIN);

                // Panel
                lv_obj_set_style_outline_color(satio_c.panel, default_outline_hue, LV_PART_MAIN);

