holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                lv_label_set_text(gpatt_c.val_yaw, String(gpattData.yaw).c_str());

                lv_label_set_text(gpatt_c.val_software_version, String(gpattData.software_version).c_str());

                lv_label_set_text(gpatt_c.val_product_id, String(gpattData.product_id).c_str());

                lv_label_set_text(gpatt_c.val_ins, String(gpattData.ins).c_str());

                lv_label_set_text(gpatt_c.val_hardware_version, String(gpattData.hardware_version).c_str());

                lv_label_set_text(gpatt_c.val_run_state_flag, String(gpattData.run_state_flag).c_str());

                lv_label_set_text(gpatt_c.val_mis_angle_num, String(gpattData.mis_angle_num).c_str());

                lv_label_set_text(gpatt_c.val_static_flag, String(gpattData.static_flag).c_str());

                lv_label_set_text(gpatt_c.val_user_code, String(gpattData.user_code).c_str());

                lv_label_set_text(gpatt_c.val_gst_data, String(gpattData.gst_data).c_str());

                lv_label_set_text(gpatt_c.val_line_flag, String(gpattData.line_flag).c_str());

                lv_label_set_text(gpatt_c.val_mis_att_flag, String(gpattData.mis_att_flag).c_str());

                lv_label_set_text(gpatt_c.val_imu_kind, String(gpattData.imu_kind).c_str());

                lv_label_set_text(gpatt_c.val_ubi_car_kind, String(gpattData.ubi_car_kind).c_str());

                lv_label_set_text(gpatt_c.val_mileage, String(gpattData.mileage).c_str());

                lv_label_set_text(gpatt_c.val_run_inetial_flag, String(gpattData.run_inetial_flag).c_str());

                lv_label_set_text(gpatt_c.val_speed_num, String(gpattData.speed_num).c_str());

                lv_label_set_text(gpatt_c.val_scalable, String(gpattData.scalable).c_str());

                lv_label_set_text(gpatt_c.val_bad_element_count, String(gpattData.total_bad_elements).c_str());
            }
        }
    }

    // ---------------------
    // Gyro screen
    // ---------------------
    else if (current_screen_number == GYRO_SCREEN) {
        if (gyro_0_c.panel) {

            // ────────────────────────────────────────────────
            // Angular
            // ────────────────────────────────────────────────
            lv_label_set_text(gyro_0_c.val_gyro_0_ang_x, String(gyroData.gyro_0_ang_x).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_ang_y, String(gyroData.gyro_0_ang_y).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_ang_z, String(gyroData.gyro_0_ang_z).c_str());

            // ────────────────────────────────────────────────
            // Acceleration
            // ────────────────────────────────────────────────
            lv_label_set_text(gyro_0_c.val_gyro_0_acc_x, String(gyroData.gyro_0_acc_x).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_acc_y, String(gyroData.gyro_0_acc_y).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_acc_z, String(gyroData.gyro_0_acc_z).c_str());

            // ────────────────────────────────────────────────
            // Gyroscope 
            // ────────────────────────────────────────────────
            lv_label_set_text(gyro_0_c.val_gyro_0_gyr_x, String(gyroData.gyro_0_gyr_x).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_gyr_y, String(gyroData.gyro_0_gyr_y).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_gyr_z, String(gyroData.gyro_0_gyr_z).c_str());

            // ────────────────────────────────────────────────
            // Magnetometer 
            // ────────────────────────────────────────────────
            lv_label_set_text(gyro_0_c.val_gyro_0_mag_x, String(gyroData.gyro_0_mag_x).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_mag_y, String(gyroData.gyro_0_mag_y).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_mag_z, String(gyroData.gyro_0_mag_z).c_str());

            // ────────────────────────────────────────────────
            // Current UI Baud Rate
            // ────────────────────────────────────────────────
            lv_label_set_text(gyro_0_c.val_gyro_0_current_uiBaud, String(gyroData.gyro_0_current_uiBaud).c_str());
        }
    }

    lv_timer_resume(display_timer);
}

/** -------------------------------------------------------------------------------------
 * @brief Sets global color scheme to default color scheme
 */
void setColorsDefault()
{
    main_bg_hue      = default_bg_hue;
    main_outline_hue = default_outline_hue;
    main_border_hue  = default_border_hue;
    main_shadow_hue  = default_shadow_hue;
    main_title_hue   = default_title_hue;
    main_value_hue   = default_value_hue;
}

/** -------------------------------------------------------------------------------------
 * @brief Sets global color scheme to custom color scheme
 */
void setColorsCustom()
{
    main_bg_hue      = custom_bg_hue;
    main_outline_hue = custom_outline_hue;
    main_border_hue  = custom_border_hue;
    main_shadow_hue  = custom_shadow_hue;
    main_title_hue   = custom_title_hue;
    main_value_hue   = custom_value_hue;
}

/** -------------------------------------------------------------------------------------
 * @brief Initialize LVGL for this device.
 */
void initSatIOUI() {
    // --------------------------------------------------------------
    // LVGL Initialization
    // --------------------------------------------------------------
    ESP_LOGI("LVGL", "Version: %d.%d.%d", LVGL_VERSION_MAJOR, LVGL_VERSION_MINOR, LVGL_VERSION_PATCH);

    delay(1000);
    
    // Initialize LVGL display object via BSP
    lv_display_t *disp = bsp_display_start();
    if (!disp) {ESP_LOGE("APP", "Failed to initialize display");}
    ESP_LOGI("APP", "Display initialized successfully");
    
    // Give BSP task time to fully initialize LVGL
    vTaskDelay(pdMS_TO_TICKS(1000));

    // Set LVGL tick period
    lv_timer_set_period(lv_timer_get_next(NULL), 50);  // ms
    
    // Initialize display brightness and backlight
    bsp_display_brightness_init();
    bsp_display_backlight_on();
    slider_brightness_value = 80;
    bsp_display_brightness_set(slider_brightness_value);

